src/ut10_old/Documents/ИзменениеСтавокОсновныхНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ИзменениеСтавокОсновныхНачислений</Name>
			<BasedOn>
				<xr:Item>Document.ПриемНаРаботу</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтавкиОсновныхВидовРасчетовСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДействуетС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРасчетовССотрудниками</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ut10_old/InformationRegisters/СтавкиОсновныхВидовРасчетовСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СтавкиОсновныхВидовРасчетовСотрудников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРасчетовССотрудниками</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ut10_old/Documents/ИзменениеСтавокОсновныхНачислений/Ext/ObjectModule.bsl
// Заполняет реквизиты значениями по умолчанию
//
// Параметры: 
//  ПараметрОбъектКопирования	- содержкит ссылку на документ копирования в случае, 
//								  если новый документ создается копированием.
//  ПараметрОснование			- содержкит ссылку на документ-основание в случае, 
//								  если новый документ создается на основании другого.
//
Процедура ИнициализироватьНовыйДокумент(ПараметрОбъектКопирования, ПараметрОснование) Экспорт

	#Если Клиент Или ВнешнееСоединение Тогда
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"), , , ПараметрОбъектКопирования, ПараметрОснование);
	#КонецЕсли

КонецПроцедуры // ИнициализироватьНовыйДокумент()	

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриемНаРаботу") Тогда
		// Заполнение шапки
		Организация = ДанныеЗаполнения.Организация;
		Сотрудник = ДанныеЗаполнения.Сотрудник;
		
		Для Каждого ТекСтрокаОсновныеНачисления Из ДанныеЗаполнения.ОсновныеНачисления Цикл
			НоваяСтрока = ОсновныеНачисления.Добавить();
			НоваяСтрока.ДействуетС = РабочаяДата;
			НоваяСтрока.ВидРасчета = ТекСтрокаОсновныеНачисления.ВидРасчета;
			НоваяСтрока.Сумма = ТекСтрокаОсновныеНачисления.Сумма;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Процедура заполняет ТЧ "ОсновныеНачисления" всеми имеющимися у сотрудниками видами расчетов,
// актуальными на текущую дату
Процедура ЗаполнитьОсновныеНачисленияСотрудника() Экспорт
	ОсновныеНачисления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтавкиОсновныхВидовРасчетовСотрудниковСрезПоследних.Сумма,
		|	СтавкиОсновныхВидовРасчетовСотрудниковСрезПоследних.ВидРасчета
		|ИЗ
		|	РегистрСведений.СтавкиОсновныхВидовРасчетовСотрудников.СрезПоследних КАК СтавкиОсновныхВидовРасчетовСотрудниковСрезПоследних
		|ГДЕ
		|   СтавкиОсновныхВидовРасчетовСотрудниковСрезПоследних.Сотрудник = &Сотрудник
		|   И СтавкиОсновныхВидовРасчетовСотрудниковСрезПоследних.Сумма <> 0
		|";
		
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрока = ОсновныеНачисления.Добавить();
			НоваяСтрока.ДействуетС = Дата;
			НоваяСтрока.ВидРасчета = ВыборкаДетальныеЗаписи.ВидРасчета;
			НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.Сумма;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр СтавкиОсновныхВидовРасчетовСотрудников
	Движения.СтавкиОсновныхВидовРасчетовСотрудников.Записывать = Истина;
	Движения.СтавкиОсновныхВидовРасчетовСотрудников.Очистить();
	
	Для Каждого ТекСтрокаОсновныеНачисления Из ОсновныеНачисления Цикл
		Движение = Движения.СтавкиОсновныхВидовРасчетовСотрудников.Добавить();
		Движение.Период = ТекСтрокаОсновныеНачисления.ДействуетС;
		Движение.Сотрудник = Сотрудник;
		Движение.ВидРасчета = ТекСтрокаОсновныеНачисления.ВидРасчета;
		Движение.Сумма = ТекСтрокаОсновныеНачисления.Сумма;
	КонецЦикла;

КонецПроцедуры
